<script setup lang="ts">
import ToolBar from "./components/ToolBar.vue";
import { ref, onMounted } from "vue";
import type { Ref } from "vue";

const editableText: Ref<HTMLDivElement | undefined> = ref();

const eventsStack: string[] = [];

const isSpaceKey: Ref<boolean> = ref(false);

const recordEvent = (value?: boolean) => {
  console.log(!isSpaceKey.value);

  if (
    // @ts-ignore: at() не поддерживается этой версий
    editableText.value?.innerHTML !== eventsStack.at(-1) &&
    !isSpaceKey.value
  ) {
    eventsStack.push(editableText.value?.innerHTML!);
  }
  isSpaceKey.value = value ? value : false;

  console.log(eventsStack);
};

onMounted(() => {
  recordEvent();
});
</script>

<template>
  <div class="container">
    <ToolBar :editableText="editableText" />
    <div
      ref="editableText"
      id="editable-text"
      @keydown.space="recordEvent(true)"
      @focusout="recordEvent(false)"
      @input="isSpaceKey = false"
      contenteditable
    >
      Таким образом консультация с широким активом представляет собой интересный
      эксперимент проверки позиций, занимаемых участниками в отношении
      поставленных задач. С другой стороны постоянное
      информационно-пропагандистское обеспечение нашей деятельности представляет
      собой интересный эксперимент проверки форм развития. Идейные соображения
      высшего порядка, а также укрепление и развитие структуры влечет за собой
      процесс внедрения и модернизации соответствующий условий активизации.
      Задача организации, в особенности же реализация намеченных плановых
      заданий играет важную роль в формировании дальнейших направлений развития.
      Повседневная практика показывает, что постоянное
      информационно-пропагандистское обеспечение нашей деятельности играет
      важную роль в формировании существенных финансовых и административных
      условий.Таким образом консультация с широким активом представляет собой
      интересный эксперимент проверки позиций, занимаемых участниками в
      отношении поставленных задач. С другой стороны постоянное
      информационно-пропагандистское обеспечение нашей деятельности представляет
      собой инйцу шо шщйоц ущойц ущошцщйуо йцщуо йщцоу щйоу шщйцош ущйтересный
      эксперимент проверки форм развития. Идейные соображения высшего порядка, а
      также укрепление и развитие структуры влечет за собой процесс внедрения и
      модернизации соответствующий условий активизации. Задача организации, в
      особенности же реализация намеченных плановых заданий играет важную роль в
      формировании дальнейших направлений развития. Повседневная практика
      показывает, что постоянное информационно-пропагандистское обеспечение
      нашей деятельности играет важную роль в формировании существенных
      финансовых и административных условий. Товарищи! новая модель
      организационной деятельности требуют от нас анализа направлений
      прогрессивного развития. Задача организации, в особенности же постоянный
      количественный рост и сфера нашей активности требуют от нас анализа
      позиций, занимаемых участниками в отношении поставленных задач. Задача
      организации, в особенности же реализация намеченных плановых заданий
      требуют от нас анализа системы обучения кадров, соответствует насущным
      потребностям.
    </div>
  </div>
</template>

<style lang="scss">
:root {
  font-family: Roboto, sans-serif;
}

* {
  box-sizing: border-box;
}

body {
  margin: 0;
  background-color: #1e1e1e;
}
.container {
  width: 60%;
  min-height: 100vh;
  margin: 0 auto;
  padding: 77px 100px;
  color: #fff;

  .img {
    width: 100%;
    height: 300px;
    object-fit: cover;
  }
}

#editable-text {
  outline: none;
}
</style>
